Tutorials1/particlesQHDFoam/2D/ejectorLagrange/system/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 0.1;

vertices        
(
    (0 0 0)
    (1 0 0)
    (1 3 0)
    (0 3 0)
    (0 0 1)
    (1 0 1)
    (1 3 1)
    (0 3 1)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (20 60 20) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    wall outlet
    (
        (3 7 6 2)
    )
    wall fixedWalls 
    (
        (0 4 7 3)
        (2 6 5 1)
        (1 5 4 0)
        (0 3 2 1)
        (4 5 6 7)
    )
);

mergePatchPairs 
(
);


// ************************************************************************* //
