Tutorials1/particlesQHDFoam/2D/ejectorLagrange/system/fvSolution
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner
        {
            preconditioner GAMG;
            smoother       GaussSeidel;
            relTol         1e-2;
            tolerance      1e-4;
        }
	tolerance       1e-10;
	relTol          0;
    }

    U
    {
	$p;
    }
    T
    {
	$p;
        nAlphaCorr 1;
	nAlphaSubCycles 1;
    }
}


PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}


// ************************************************************************* //
